# ConnectorInsideDiameter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ConnectorInsideDiameter Property
ParameterTypeId Class See Also
---
"Inside Diameter"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ConnectorInsideDiameter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ConnectorInsideDiameter As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ConnectorInsideDiameter {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace